# Creating views 1

In this exercise, we learn how to create different types of views and how to drop views. 

Ensure that you have downloaded the database file Chinook.db.

## Learning objectives

By the end of this train, you should be able to:
- Create `LOOKUP`, `JOIN`, and `AGGREGATING` views.
- Drop a view.

First, let's load our sample database:

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [2]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

'Connected: @chinook.db'

In [7]:
%%sql
SELECT * FROM Employees LIMIT 5

 * sqlite:///chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')]

Here is a [view](https://www.lucidchart.com/pages/er-diagrams) of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:500px";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Create a `LOOKUP` view of the surname, first name, title, and country of each employee called `Employee_View`.

In [8]:
%%sql
CREATE VIEW Employee_view 
AS 
SELECT LastName ,FirstName, Title, Country
FROM Employees

 * sqlite:///chinook.db
Done.

[]

### Exercise 2


Query the `Employee_View` view to get a view of the sales team.

Use the wildcard operators and the LIKE query to filter all the employees in the specified view.

In [9]:
%%sql
SELECT
    *
FROM Employee_view
WHERE Title LIKE '%Sales%'

 * sqlite:///chinook.db
Done.

[('Edwards', 'Nancy', 'Sales Manager', 'Canada'),
 ('Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('Johnson', 'Steve', 'Sales Support Agent', 'Canada')]

### Exercise 3


Create a `JOIN` view that will link up all the customers with the support staff assisting them, called `Customer_Support_View`. We want to view the following:

- First name of the customer
- Last name (surname) of the customer
- Country where the customer resides
- SupportRepId
- EmployeeId
- Last name of the employee
- First name of the employee
- Job title of the employee
- Country where the employee operated from

In [15]:
%%sql
CREATE VIEW Customer_Support_View_2
AS
SELECT 
    customers.FirstName,
    customers.LastName,
    customers.Country,
    customers.SupportRepId,
    employees.EmployeeId,
    employees.LastName,
    employees.FirstName,
    employees.Title,
    employees.Country
FROM customers 
JOIN
    employees
    ON customers.SupportRepId = employees.EmployeeId

 * sqlite:///chinook.db
Done.

[]

### Exercise 4

Query the `Customer_Support_View` view to get a list of the names and surnames of the clients who were helped by an employee with the `Employeeid` '3'.

In [16]:
%%sql
SELECT *
FROM Customer_Support_View_2
WHERE EmployeeId = 3

 * sqlite:///chinook.db
Done.

[('Luís', 'Gonçalves', 'Brazil', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('François', 'Tremblay', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Roberto', 'Almeida', 'Brazil', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Jennifer', 'Peterson', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Michelle', 'Brooks', 'USA', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Tim', 'Goyer', 'USA', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Frank', 'Ralston', 'USA', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Robert', 'Brown', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Edward', 'Francis', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Ellie', 'Sullivan', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Fynn', 'Zimmermann', 'Germany', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Niklas', 'Schröder', 'Germany', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Wyatt', 'Girard', 'France', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Isabelle', 'Mercier', 'France', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Terhi', 'Hämäläinen', 'Finland', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Ladislav', 'Kovács', 'Hungary', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Hugh', "O'Reilly", 'Ireland', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Emma', 'Jones', 'United Kingdom', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Phil', 'Hughes', 'United Kingdom', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Manoj', 'Pareek', 'India', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Puja', 'Srivastava', 'India', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada')]

### Exercise 5

Create an `AGGREGATING` view that counts the number of customers that are currently being serviced per country, called `Customer_per_Country_View`.

We would like to see the country name and the number of customers in this view.

In [24]:
%%sql
CREATE VIEW Customer_per_Country_View_1 AS 
SELECT COUNT (CustomerId) AS Num_customers, Country
FROM customers
GROUP BY Country;

 * sqlite:///chinook.db
Done.

[]

### Exercise 6
Write a query that returns the country with the most customers from `Customer_per_Country_View`.

In [25]:
%%sql

SELECT Country, MAX(Num_customers) 
FROM Customer_per_Country_View_1

 * sqlite:///chinook.db
Done.

[('USA', 13)]

### Exercise 7

Write a query that will delete the `Employee_View` view.

In [26]:
%%sql
DROP VIEW Employee_View

 * sqlite:///chinook.db
Done.

[]

### Challenge question

Write a query that returns the number of customers that each support employee services, along with the name of the employee. Call this view `Support_Person_Stats`.

To do this, we will need to create a view, join the Customer and Employee tables, and use the `COUNT` and `GROUP BY` functions to aggregate the number of employees serviced by each employee.

In [27]:
%%sql
CREATE VIEW Support_Person_Stats AS
SELECT COUNT(c.SupportRepId) Count_of_Customers_Serviced , e.EmployeeId, e.LastName
FROM customers c 
INNER JOIN employees e
ON c.SupportRepId = e.EmployeeId
GROUP BY e.EmployeeId;

 * sqlite:///chinook.db
Done.

[]

In [28]:
%%sql
SELECT * FROM Support_Person_Stats

 * sqlite:///chinook.db
Done.

[(21, 3, 'Peacock'), (20, 4, 'Park'), (18, 5, 'Johnson')]

* Note: Because views are added to the main database after they are created, if we want to perform the `CREATE VIEW` commands again, we must first drop the prior view to prevent receiving a 'VIEW already exists' error.